InformationRegisters/ИзбранныеОтчетыПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИзбранныеОтчетыПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОтчетыПотолки/Ext/Module.bsl
#Область СписокОтчетов

// Процедура формирует таблицу отчетов по заданным отборам
// 	Вызывается в фоновом задании из общей формы ОтчетыИзбранное.
//
// Параметры:
//  Параметры					 - Структура - Параметры используемые для расчета, обязательные ключи:
//										* Период - период расчет потребностей,
//										* СпособПополнения - ПеречислениеСсылка.СпособыПополненияЗапасов - способ пополнения, по которому будет отобрана номенклатура,
//										* Настройки - НастройкиКомпоновкиДанных - настройки КД, содержащие отборы для расчета потребностей
//  ВременноеХранилищеРезультата - Строка	 - Возвращаемый в родительский сеанс параметр. Содержит таблицу отчетов.
//
Процедура СформироватьСписокОтчетов(Параметры, ВременноеХранилищеРезультата) Экспорт
		
	СписокОтчетов = Параметры.СписокОтчетов.СкопироватьКолонки();
	ОтчетыПользователя = Новый СписокЗначений;
	ОтчетыПользователя.ЗагрузитьЗначения(ВариантыОтчетов.ОтчетыТекущегоПользователя());
	ОтключенныеВарианты = Новый СписокЗначений;
	//ОтключенныеВарианты.ЗагрузитьЗначения(ОтчетыУНФПовтИсп.ВариантыНедоступныеПоФО());
	//ОтключенныеПредопределенныеВарианты = Новый СписокЗначений;
	//ОтключенныеПредопределенныеВарианты.ЗагрузитьЗначения(ОтчетыУНФПовтИсп.ПредопределенныеВариантыНедоступныеПоФО());
	//
	//СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	//
	//ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	//ИсточникДанных.Имя = "ИсточникДанных1";
	//ИсточникДанных.ТипИсточникаДанных = "local";
	//
	//НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//НаборДанных.ИсточникДанных = "ИсточникДанных1";
	//НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	//НаборДанных.Запрос = ТекстЗапросаТаблицаОтчетов(Параметры);
	//НаборДанных.Имя = "НаборДанных1";
	//
	//АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Параметры.УникальныйИдентификатор);
	//ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	//КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	//
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетыПользователя", 
	//	ОтчетыПользователя);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтключенныеВарианты", 
	//	ОтключенныеВарианты);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтключенныеПредопределенныеВарианты", 
	//	ОтключенныеПредопределенныеВарианты);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущийПользователь", 
	//	Пользователи.ТекущийПользователь());
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подсистема", 
	//	Параметры.ТекущийРаздел);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТаблицаПодсистем", 
	//	Параметры.ПодсистемыПрограммы);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЭтоОсновнойЯзык", 
	//	ОбщегоНазначения.ЭтоОсновнойЯзык());
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КодЯзыка", 
	//	ТекущийЯзык().КодЯзыка);
	//
	//Если Параметры.Раздел = РазделИзбранные() Тогда
	//	Список = Новый СписокЗначений;
	//	Список.ЗагрузитьЗначения(Параметры.Избранное);
	//	УстановитьОтборКомпоновщика(КомпоновщикНастроек.Настройки, "Ссылка", ВидСравненияКомпоновкиДанных.ВСписке, Список);
	//КонецЕсли;
	//Если Параметры.Раздел = РазделВнешние() Тогда
	//	УстановитьОтборКомпоновщика(КомпоновщикНастроек.Настройки, "Внешний", ВидСравненияКомпоновкиДанных.Равно, Истина);
	//КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Параметры.ПоОбъекту) Тогда
	//	УстановитьОтборКомпоновщика(КомпоновщикНастроек.Настройки, "Включен", ВидСравненияКомпоновкиДанных.Равно, Истина);
	//КонецЕсли;
	//ДобавитьОтборыТеги(КомпоновщикНастроек.Настройки, Параметры); 
	//Если Параметры.Раздел = РазделПоследние() Тогда
	//	УстановитьОтборыИстория(КомпоновщикНастроек.Настройки, Параметры);
	//ИначеЕсли ЗначениеЗаполнено(Параметры.ПоОбъекту) Тогда
	//	УстановитьОтборыКонтекстныеОтчеты(КомпоновщикНастроек.Настройки, Параметры);
	//КонецЕсли;
	//
	//Если Параметры.Раздел <> РазделИзбранные() Тогда
	//    ДобавитьЭлементУпорядочивания(КомпоновщикНастроек.Настройки, "Важный", "Убыв");
	//КонецЕсли;
	//ДобавитьЭлементУпорядочивания(КомпоновщикНастроек.Настройки, "Порядок");
	//
	//Для каждого Колонка Из СписокОтчетов.Колонки Цикл
	//	ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	//КонецЦикла;
	//ГруппировкаДетальныеЗаписи = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , 
	//	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//ТаблицаОтчетов = Новый ТаблицаЗначений;
	//ПроцессорВывода.УстановитьОбъект(ТаблицаОтчетов);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//ЗаполняемыеПоля = Новый Массив;
	//ЗаполняемыеПоля.Добавить("Отчет, ИмяОтчета, Вариант, КлючВарианта, Наименование, Теги, Описание, Пользовательский");
	//ЗаполняемыеПоля.Добавить("АвторТекущийПользователь, Подсистема, Важный, СмТакже, Внешний, Видимость, Порядок, Автор");
	//ЗаполняемыеПоля = СтрСоединить(ЗаполняемыеПоля, ", ");
	//
	//// Проверка на присутствие отчета в нескольких подсистемах - отображаем только в первой
	//ДобавленныеОтчеты = Новый Массив;
	//Для каждого НайденныйОтчет Из ТаблицаОтчетов Цикл
	//	Если ДобавленныеОтчеты.Найти(НайденныйОтчет.Вариант) <> Неопределено Тогда
	//		Продолжить;	
	//	КонецЕсли;
	//	ДобавленныеОтчеты.Добавить(НайденныйОтчет.Вариант);
	//	СтрОтчет = СписокОтчетов.Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрОтчет, НайденныйОтчет, ЗаполняемыеПоля);
	//	Если ТипЗнч(СтрОтчет.Вариант) = Тип("СправочникСсылка.ВариантыОтчетов")
	//		Или ТипЗнч(СтрОтчет.Вариант) = Тип("СправочникСсылка.ВариантыДополнительныхОтчетов") Тогда
	//		СтрОтчет.УИД = СтрЗаменить(СтрОтчет.Вариант.УникальныйИдентификатор(), "-", "");
	//	Иначе
	//		СтрОтчет.УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Параметры.ПоОбъекту) Тогда
	//		СтрОтчет.Раздел = Параметры.ТекущийРаздел;
	//	Иначе	
	//		СтруктураОтбора = Новый Структура;
	//		СтруктураОтбора.Вставить("Ссылка", НайденныйОтчет.Подсистема);
	//		НайденныеПодсистемы = Параметры.ПодсистемыПрограммы.НайтиСтроки(СтруктураОтбора);
	//		Если НайденныеПодсистемы.Количество() > 0 Тогда
	//			СтрОтчет.Раздел = НайденныеПодсистемы[0].РазделСсылка;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если ТипЗнч(НайденныйОтчет.Образец) = Тип("ХранилищеЗначения") Тогда
	//		Образец = НайденныйОтчет.Образец.Получить();
	//		СтрОтчет.Образец = Образец;
	//	КонецЕсли;
	//КонецЦикла;
	//Если Параметры.Раздел = РазделПоследние() Тогда
	//	СписокОтчетов.Сортировать("Порядок");
	//Иначе
	//	СписокОтчетов.Сортировать("Важный УБЫВ, Порядок");
	//КонецЕсли;
	//ТекущийИндекс = 0;
	//Для каждого СтрокаОтчета Из СписокОтчетов Цикл
	//	СтрокаОтчета.ИндексСтроки = ТекущийИндекс;
	//	ТекущийИндекс = ТекущийИндекс + 1;
	//КонецЦикла;
	//
	//ПроверитьДоступность(СписокОтчетов, Параметры);
	//
	//СтруктураРезультат = Новый Структура;
	//СтруктураРезультат.Вставить("СписокОтчетов", СписокОтчетов);
	//Если Параметры.Свойство("СвязанныеПоля") Тогда
	//	СтруктураРезультат.Вставить("СвязанныеПоля", Параметры.СвязанныеПоля);
	//КонецЕсли;
	//ПоместитьВоВременноеХранилище(СтруктураРезультат, ВременноеХранилищеРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельИзбранноеНачальнаяСтраница

&НаСервере
Функция ТаблицаОтчетовПользователяНаНачальнойСтранице() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""00000000-0000-0000-0000-000000000000"" КАК УИД,
	|	ИзбранныеОтчетыПользователя.ВариантОтчета КАК Вариант,
	|	ИзбранныеОтчетыПользователя.ВариантОтчета.Отчет КАК Отчет,
	|	ИзбранныеОтчетыПользователя.ВариантОтчета.КлючВарианта КАК КлючВарианта,
	|	ИзбранныеОтчетыПользователя.ВариантОтчета.Наименование КАК Наименование,
	|	ИзбранныеОтчетыПользователя.ВариантОтчета.Описание КАК Описание,
	|	ИзбранныеОтчетыПользователя.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.ИзбранныеОтчетыПользователя КАК ИзбранныеОтчетыПользователя
	|ГДЕ
	|	ИзбранныеОтчетыПользователя.Пользователь = &ТекущийПользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИзбранныеОтчетыПользователя.Порядок";
	
	ТаблицаОтчетов = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЗ из ТаблицаОтчетов Цикл
		Если ТипЗнч(СтрокаТЗ.Вариант) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
			СтрокаТЗ.УИД = СтрЗаменить(СтрокаТЗ.Вариант.УникальныйИдентификатор(), "-", "");
		Иначе
			СтрокаТЗ.УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаОтчетов;
	
КонецФункции

#КонецОбласти

#Область ОтчетыЭффективности

// вызывается из ВариантыОтчетов.ДеревоПредопределенных
Процедура ДобавитьПредопределенныеВариантыОтчетовНеСКД(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип) Экспорт
	
	Если ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьЗамерщиков Тогда
		ОтчетыЭффективности.ДобавитьПредопределенныеВариантыОтчетаЭффективностьЗамерщиков(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип);
		
	ИначеЕсли ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьМенеджеров Тогда
		ОтчетыЭффективности.ДобавитьПредопределенныеВариантыОтчетаЭффективностьМенеджеров(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип);
		
	ИначеЕсли ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьМаркетинга 
		ИЛИ ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьВидовКонтакта
		ИЛИ ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьРекламныхАкций
		ИЛИ ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьРекламныхИсточников
		ИЛИ ОписаниеОтчета.Метаданные = Метаданные.Отчеты.ЭффективностьТочекПродаж		
		Тогда
		ОтчетыЭффективности.ДобавитьПредопределенныеВариантыОтчетаЭффективностьПоЛидам(ТаблицаВариантов, ОписаниеОтчета, ОтчетТип);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаОтчетов

Процедура НастроитьОтображениеГруппировкиПодразделение(Настройки) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда
	
		КоллекцияГрупп = Настройки.Структура;
		ОтключитьГруппировкуОтчета(КоллекцияГрупп, "Подразделение");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьГруппировкуОтчета(КоллекцияГрупп, ИмяГруппировки)
	
	Отключена = СостояниеЭлементаНастройкиКомпоновкиДанных.Отключен;
	
	Для каждого ТекущаяГруппировка из КоллекцияГрупп Цикл
		
		Если ТипЗнч(ТекущаяГруппировка) = Тип("ГруппировкаКомпоновкиДанных")
			ИЛИ ТипЗнч(ТекущаяГруппировка) = Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			
			ЕстьГруппировка = ЕстьГруппировкаВПоляхГруппировки(ТекущаяГруппировка.ПоляГруппировки, ИмяГруппировки);
			
			Если ЕстьГруппировка Тогда
				ТекущаяГруппировка.Состояние = Отключена;
			Иначе
				// идем по дереву
				КоллекцияГрупп = ТекущаяГруппировка.Структура;
				ОтключитьГруппировкуОтчета(КоллекцияГрупп, ИмяГруппировки);
			КонецЕсли;
			
			
		ИначеЕсли ТипЗнч(ТекущаяГруппировка) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			КоллекцияГрупп = ТекущаяГруппировка.Строки;
			ОтключитьГруппировкуОтчета(КоллекцияГрупп, ИмяГруппировки);
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция ЕстьГруппировкаВПоляхГруппировки(ПоляГруппировки, ИмяГруппировки)
	
	ЕстьГруппировка = Ложь;
	
	Для каждого ПолеКомпоновки из ПоляГруппировки.Элементы Цикл
		Если ПолеКомпоновки.Поле = Новый ПолеКомпоновкиДанных(ИмяГруппировки) Тогда
			ЕстьГруппировка = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьГруппировка;
	
КонецФункции
				
#КонецОбласти
